app/Controllers/Antrian.php

	public function index(){
		$data['title'] = "Sistem Antrian";
		$data['pelayanan']	= $this->pelayananProsesModel->select("*")->orderBy('id', 'DESC')->get()->getResultArray();
---
SELECT *
FROM `pelayanan`
ORDER BY `id` DESC

	public function antrian(){

		$data['panggilTerakhir'] = $this->antrianProsesModel->select('antrian.*, a.kode, b.nama as nama_loket')
		->join('pelayanan a', 'antrian.pelayanan_id=a.id')
		->join('loket b', 'antrian.loket_id=b.id')->where('antrian.status', 1)
		->orderBy('antrian.waktu_panggil', 'DESC')->limit(1)->get();

		$data['detailLoket']	= $this->loketProsesModel->select("loket.id, loket.nama, a.kode")
		->join('pelayanan a', 'loket.pelayanan_id=a.id')
		->orderBy('id', 'ASC')->get()->getResultArray();
---
SELECT `antrian`.*, `a`.`kode`, `b`.`nama` as `nama_loket`
FROM `antrian`
JOIN `pelayanan` `a` ON `antrian`.`pelayanan_id`=`a`.`id`
JOIN `loket` `b` ON `antrian`.`loket_id`=`b`.`id`
WHERE `antrian`.`status` = 1
ORDER BY `antrian`.`waktu_panggil` DESC
 LIMIT 1
SELECT `loket`.`id`, `loket`.`nama`, `a`.`kode`
FROM `loket`
JOIN `pelayanan` `a` ON `loket`.`pelayanan_id`=`a`.`id`
ORDER BY `id` ASC